math/ka/ka.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-28 Tue 20:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kolmogorov-Arnold Representation Theorem with Haskell code examples</title>
<meta name="author" content="Tobi Lehman" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Kolmogorov-Arnold Representation Theorem with Haskell code examples</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org10dee8b">1. Introduction</a></li>
<li><a href="#orgfec7d0c">2. Theorem Statement</a></li>
<li><a href="#orga070006">3. Proof</a></li>
<li><a href="#orgdbbcb5c">4. Haskell Implementation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org10dee8b" class="outline-2">
<h2 id="org10dee8b"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The Kolmogorov-Arnold representation theorem states that any continuous function \(f:[0,1]^n \to \mathbb{R}\) of several variables can be represented as a finite sum of continuous functions \(\phi_{ij}\) of one variable. This also feels similar to 'currying' in the Haskell programming language.
</p>

<p>
Suppose you had a function \( f : [0,1]\times[0,1] \to \mathbb{R} \), in Haskell the function signature could be:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #412f7e;">f</span> <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Num</span> a <span style="color: #5f4f93;">=&gt;</span> (a,a) <span style="color: #5f4f93;">-&gt;</span> a
<span style="color: #412f7e;">f</span> (x,y) <span style="color: #5f4f93;">=</span> x <span style="color: #5f4f93;">+</span> y

<span style="color: #9a2d71; font-weight: bold;">:</span><span style="color: #2e4d98; font-weight: bold;">type</span> curry f
<span style="color: #412f7e;">curry</span> f <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Num</span> c <span style="color: #5f4f93;">=&gt;</span> c <span style="color: #5f4f93;">-&gt;</span> c <span style="color: #5f4f93;">-&gt;</span> c
</pre>
</div>

<p>
The <code>curry</code> function converts a multi-variable function that takes in tuples like \( (x,y) \) and replaces them with multiple functions of a single variable. Notice how <code>curry f</code> only takes a single number, then it returns a function <code>c -&gt; c</code> that takes another number and then returns a number.
</p>
</div>
</div>

<div id="outline-container-orgfec7d0c" class="outline-2">
<h2 id="orgfec7d0c"><span class="section-number-2">2.</span> Theorem Statement</h2>
<div class="outline-text-2" id="text-2">
<p>
\[ f(x_1, x_2, \ldots, x_n) = \sum_{i=1}^{2n+1} g_i \left( \sum_{j=1}^{n} \varphi_{ij}(x_j) \right)\]
</p>
</div>
</div>

<div id="outline-container-orga070006" class="outline-2">
<h2 id="orga070006"><span class="section-number-2">3.</span> Proof</h2>
</div>


<div id="outline-container-orgdbbcb5c" class="outline-2">
<h2 id="orgdbbcb5c"><span class="section-number-2">4.</span> Haskell Implementation</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2e4d98; font-weight: bold;">module</span> <span style="color: #9a2d71; font-weight: bold;">KolmogorovArnold</span> <span style="color: #2e4d98; font-weight: bold;">where</span>

<span style="color: #615855; font-style: italic;">-- </span><span style="color: #615855; font-style: italic;">Example function</span>
<span style="color: #412f7e;">f</span> <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span>
<span style="color: #412f7e;">f</span> x y <span style="color: #5f4f93;">=</span> x<span style="color: #5f4f93;">^</span>2 <span style="color: #5f4f93;">+</span> y<span style="color: #5f4f93;">^</span>2

<span style="color: #615855; font-style: italic;">-- </span><span style="color: #615855; font-style: italic;">Functions g_i and phi_ij for the representation</span>
<span style="color: #412f7e;">g1, g2</span> <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span>
<span style="color: #412f7e;">g1</span> z <span style="color: #5f4f93;">=</span> z
<span style="color: #412f7e;">g2</span> z <span style="color: #5f4f93;">=</span> z

<span style="color: #412f7e;">phi1, phi2</span> <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span>
<span style="color: #412f7e;">phi1</span> x <span style="color: #5f4f93;">=</span> x
<span style="color: #412f7e;">phi2</span> y <span style="color: #5f4f93;">=</span> y

<span style="color: #615855; font-style: italic;">-- </span><span style="color: #615855; font-style: italic;">Kolmogorov-Arnold representation</span>
<span style="color: #412f7e;">karRepresentation</span> <span style="color: #5f4f93;">::</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span> <span style="color: #5f4f93;">-&gt;</span> <span style="color: #9a2d71; font-weight: bold;">Double</span>
<span style="color: #412f7e;">karRepresentation</span> x y <span style="color: #5f4f93;">=</span> g1 (phi1 x <span style="color: #5f4f93;">+</span> phi2 y) <span style="color: #5f4f93;">+</span> g2 (phi1 x <span style="color: #5f4f93;">+</span> phi2 y)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tobi Lehman</p>
<p class="date">Created: 2024-05-28 Tue 20:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
